tests:
  - desc: '%context'
    expression: '%context.n1'
    result: 1
  - desc: '%ucum'
    variables:
      ucum: 'http://unitsofmeasure.org'
    expression: '%ucum'
    result: 'http://unitsofmeasure.org'
  - expression: '%a - 1'
    variables:
      a: 5
    result: 4
  - desc: 'Escaped variables'
    expression: '%"a.b() - 1" - 2'
    variables:
      "a.b() - 1": 5
    result: 3

subject:
  n1: 1
